In [1]:
import pandas as pd

df = pd.read_csv("data/stocks/AAPL.csv")
df.head()

         Date      Open      High       Low     Close  Adj Close     Volume
0  1980-12-12  0.513393  0.515625  0.513393  0.513393   0.406782  117258400
1  1980-12-15  0.488839  0.488839  0.486607  0.486607   0.385558   43971200
2  1980-12-16  0.453125  0.453125  0.450893  0.450893   0.357260   26432000
3  1980-12-17  0.462054  0.464286  0.462054  0.462054   0.366103   21610400
4  1980-12-18  0.475446  0.477679  0.475446  0.475446   0.376715   18362400

In [2]:
df.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
9904,2020-03-26,246.520004,258.679993,246.360001,258.440002,258.440002,63021800
9905,2020-03-27,252.750000,255.869995,247.050003,247.740005,247.740005,51054200
9906,2020-03-30,250.740005,255.520004,249.399994,254.809998,254.809998,41994100
9907,2020-03-31,255.600006,262.489990,252.000000,254.289993,254.289993,49250500
9908,2020-04-01,246.500000,248.720001,239.130005,240.910004,240.910004,43956200

In [10]:
df.loc[df["Close"] <= 0.5]

            Date      Open      High       Low     Close  Adj Close     Volume
1     1980-12-15  0.488839  0.488839  0.486607  0.486607   0.385558   43971200
2     1980-12-16  0.453125  0.453125  0.450893  0.450893   0.357260   26432000
3     1980-12-17  0.462054  0.464286  0.462054  0.462054   0.366103   21610400
4     1980-12-18  0.475446  0.477679  0.475446  0.475446   0.376715   18362400
34    1981-02-02  0.477679  0.477679  0.475446  0.475446   0.376715    5941600
...          ...       ...       ...       ...       ...        ...        ...
4306  1997-12-24  0.464286  0.473214  0.464286  0.468750   0.406894   24458000
4307  1997-12-26  0.466518  0.477679  0.464286  0.475446   0.412707   26969600
4308  1997-12-29  0.475446  0.479911  0.459821  0.468750   0.406894   69549200
4309  1997-12-30  0.464286  0.479911  0.455357  0.470982   0.408832   85626800
4310  1997-12-31  0.468750  0.486607  0.462054  0.468750   0.406894  101589600

[974 rows x 7 columns]

In [12]:
# Penny stock definition: stock prices less than 1 dollar.

df.iloc[-1]["Close"]

240.91000366210935

In [13]:
# We will do something like getting the min value of a stock that is less than one dollar. 
# Then compare with how much it is now.

minValue = min(list(df["Close"]))
print(minValue)

0.1964285671710968

In [14]:
df.loc[df["Close"] == minValue]

           Date      Open      High       Low     Close  Adj Close    Volume
394  1982-07-08  0.198661  0.198661  0.196429  0.196429   0.155638  41081600

In [36]:
# Compared to today.
before = df.loc[df["Close"] == minValue]["Close"].item()
later = df.iloc[-1]["Close"].item()

print(before)
print(later)

0.1964285671710968
240.91000366210935

In [34]:
before = df.loc[df["Close"] == minValue]["Date"]
later = df.iloc[-1]["Date"]
print(before)
print(later)

394    1982-07-08
Name: Date, dtype: object
2020-04-01

In [32]:
0.01 * later / before

12.264509543169835

In [37]:
later / before

1226.4509543169834

In [ ]:
# How do we want to analyze it?  Maybe turn it into a JSON?
# For the front-end, how would it digest it?

"""
const data = {
    "Apple": {start: "1982-07-08", end: "2020-04-01", multiplier: 1226.45},
    ...
    ...
}
"""

In [96]:
import os
import pandas as pd


files = os.listdir("data/stocks/")
print(files[:10])

['RIV.csv', 'ANTE.csv', 'CSCO.csv', 'PRI.csv', 'NZF.csv', 'HLNE.csv', 'UNT.csv', 'HUBS.csv', 'GPL.csv', 'SBGI.csv']

In [97]:
files.sort()
print(files[:20])

['A.csv', 'AA.csv', 'AACG.csv', 'AAL.csv', 'AAMC.csv', 'AAME.csv', 'AAN.csv', 'AAOI.csv', 'AAON.csv', 'AAP.csv', 'AAPL.csv', 'AAT.csv', 'AAU.csv', 'AAWW.csv', 'AAXN.csv', 'AB.csv', 'ABB.csv', 'ABBV.csv', 'ABC.csv', 'ABCB.csv']

In [102]:
f = "NLOK.csv"

df = pd.read_csv(f"data/stocks/{f}")
min_val = min(list(df["Close"]))
print(min_val)

nan

In [103]:
len(df)

278

In [99]:
df.head()

         Date  Open  High  Low  Close  Adj Close  Volume
0  2002-02-01   NaN   NaN  NaN    NaN        NaN     NaN
1  2003-11-20   NaN   NaN  NaN    NaN        NaN     NaN
2  2004-12-01   NaN   NaN  NaN    NaN        NaN     NaN
3  2013-08-22   NaN   NaN  NaN    NaN        NaN     NaN
4  2013-11-21   NaN   NaN  NaN    NaN        NaN     NaN

In [105]:
df = df.dropna()
len(df)

251

In [106]:
df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
27,2019-03-08,21.629999,21.959999,21.500000,21.950001,12.452044,4091400.0
28,2019-03-11,21.980000,22.510000,21.980000,22.379999,12.695979,5087100.0
29,2019-03-12,22.360001,22.620001,22.320000,22.459999,12.741362,3749800.0
30,2019-03-13,22.490000,23.080000,22.459999,22.950001,13.019337,5489300.0
31,2019-03-14,22.540001,23.250000,22.450001,22.930000,13.007990,4309300.0

In [91]:
df.head()

         Date  Open  High  Low  Close  Adj Close  Volume
0  2002-02-01   NaN   NaN  NaN    NaN        NaN     NaN
1  2003-11-20   NaN   NaN  NaN    NaN        NaN     NaN
2  2004-12-01   NaN   NaN  NaN    NaN        NaN     NaN
3  2013-08-22   NaN   NaN  NaN    NaN        NaN     NaN
4  2013-11-21   NaN   NaN  NaN    NaN        NaN     NaN

In [81]:
latest_date = max(list(df["Date"]))
print(latest_date)

2020-04-01

In [82]:
start = df.loc[df["Close"] == min_val]
end = df.loc[df["Date"] == latest_date]

print(start)
print(end)

            Date      Open      High       Low     Close     Adj Close  Volume
1288  1987-12-09  0.500000  0.500000  0.481481  0.481481  6.995918e+18   17500
1311  1988-01-13  0.481481  0.481481  0.481481  0.481481  6.995918e+18    4000
1312  1988-01-14  0.481481  0.481481  0.481481  0.481481  6.995918e+18       0
            Date       Open       High    Low  Close  Adj Close   Volume
9430  2020-04-01  21.549999  21.969999  19.65  19.74      19.74  1421000

In [83]:
start_val = start.iloc[-1]["Close"].item()
end_val = end.iloc[-1]["Close"].item()

print(start_val)
print(end_val)

0.4814814925193786
19.739999771118164

In [84]:
multiplier = end_val / start_val

In [85]:
print(multiplier)

40.99846012320748

In [86]:
print(f"{f}: {start_val}, {end_val}, {multiplier}")

AAN.csv: 0.4814814925193786, 19.739999771118164, 40.99846012320748

In [89]:

# Then get start and end dates.
start_date = start.iloc[-1]["Date"]
end_date = end.iloc[-1]["Date"]

print(start_date, end_date)

1988-01-14 2020-04-01